---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterNumericEquals
source: html/1673c989-c11a-5b59-0686-753db45c69da.htm
---
# FilterNumericEquals Properties

Specifies whether the .NET object represents a valid Revit entity.